[{"id":1,"title":"DeepMind is experimenting with a nearly indestructible robot hand","subhead":"A new robotic hand can withstand being smashed by pistons or walloped with a hammer. It was designed to survive the trial-and-error interactions required to train AI robots.","tags":"Technology","author":"Martin David","content":"A new robot hand provides extremely fast and flexible finger movements, while also being tough enough to survive intense damage. That durability helps the hand, which is already being used in Google DeepMind’s robotics experiments, during the trial-and-error learning required to train artificial intelligence. This latest robotic hand developed by the UK-based Shadow Robot Company can go from fully open to closed within 500 milliseconds and perform a fingertip pinch with up to 10 newtons of force. It can also withstand repeated punishment such as pistons punching the fingers from multiple angles or a person smashing the device with a hammer. The new hand’s robust design is well suited for AI-powered robotics experiments based on reinforcement learning, which allows robots to gradually learn how to interact with environments by fumbling through tasks using trial and error, says Ram Ramamoorthy at the University of Edinburgh in the UK. “Any interaction with the world is a collision damage risk,” said Rich Walker, director of the Shadow Robot Company, during a press conference.","img_path":"\\styles\\images\\tech.jpg"},{"id":2,"title":"How fashion rules the world","subhead":"In the 21st century the style trends of the fashion industry dominate the world more than they ever did, and control not only the way people dress but also trends in home ware design, makeup fashion and people’s overall attitudes.","tags":"Fashion","author":"Angelia Walker","content":"In the ever-evolving landscape of the 21st century, fashion has transcended its traditional boundaries. Today, it's not just about following trends; it's about celebrating diversity and promoting inclusivity. Fashion designers are now acknowledging the beauty in every shape, size, and color, creating collections that resonate with a global audience. One of the most significant shifts in recent years is the growing emphasis on sustainability. Fashion is no longer just about looking good; it's about making ethical choices. From eco-friendly fabrics to ethical manufacturing practices, the industry is witnessing a revolution towards a more sustainable future. The rise of social media platforms has democratized fashion in unprecedented ways. Fashion enthusiasts around the world are no longer mere spectators; they are active participants, influencing and being influenced by the latest trends. Instagram, Pinterest, and TikTok have become virtual runways, allowing individuals to showcase their unique styles and inspiring others in the process. Fashion has evolved beyond being a mere means of covering our bodies; it's a form of self-expression and identity. People now use fashion to convey their beliefs, affiliations, and even moods. The clothes we wear tell a story, making a profound statement about who we are and what we stand for.","img_path":"\\styles\\images\\fashion.jpeg"},{"id":3,"title":"Cameron Burgess revels in success as hard work pays off","subhead":"The Australian defender’s path to the top flight has not been straightforward but under manager Kieran McKenna at Ipswich Town he has thrived.","tags":"Sport","author":"Jack Harry","content":"Never give up. Keep working hard, believe in yourself and never throw in the towel. Those cliches are the mainstay of sports psychology books the world over. For most they are mere words, just catchphrases. But not to 28-year-old defender Cameron Burgess. The Aberdeen-born, Western Australia-raised footballer is living proof that dreams can come true, that perseverance and dedication do pay off. Burgess is celebrating Ipswich Town’s stunning promotion to the Premier League and the end of the club’s top-flight exile of 22 years. It comes just 12 months after the Tractor Boys vaulted from League One into the Championship, with back-to-back promotions adding another layer to the club’s scarcely believable story. “It’s been pretty surreal to be fair, I won’t lie,” Burgess says. “It’s been a mad journey so there’s not been a lot of time to reflect. It’s been pretty special. To go back-to- back is something crazy that I probably wouldn’t even think about until the day I hang up my boots. ”Burgess has been there the whole astonishing, madcap two years at Portman Road. Making 71 appearances over the past two seasons, the centre-back has been a key member of manager Kieran McKenna’s team, a defensive iron at the back protecting McKenna’s attacking arsenal. But it almost never happened. Four years ago the Australian’s career was at a crossroads; he was languishing in the fourth tier and on loan at Salford City when the Covid-19 pandemic hit. After nine years playing in the lower leagues in England and Scotland, from Cheltenham Town to Bury to Scunthorpe United after first arriving at Fulham’s academy as a 15-year-old, he strongly considered a move back to the A-League.","img_path":"\\styles\\images\\sport.jpg"},{"id":4,"title":"Eurozone retail sales for March see biggest surge in 18 months","subhead":"Eurozone retail sales in March surged, marking the highest increase since September 2022. European stocks reacted positively, buoyed by better-than-expected corporate earnings and hopes of an ECB interest rate cut.","tags":"Economy","author":"Jean Klimth","content":"Eurozone retail sales witnessed their sharpest monthly increase since September 2022, displaying promising signs of economic recovery in household consumption. Data released by Eurostat on Tuesday revealed retail sales in the euro area advanced by 0.8% month-on-month in March. The rebound came after an upwardly revised decline of 0.3% in February and exceeded market expectations of a 0.6% increase. Annually, sales grew by 0.7%, reversing a 0.5% contraction in February and marking the first positive annual rate since September 2022, the highest since May 2022. In the euro area, March's data showed a 1.2% rise in sales of food, drinks, and tobacco, while non-food products (excluding motor fuel) remained stable. Sales of such  fuel in specialised stores saw a 2.0% increase. Across the broader European Union, food, drinks, and tobacco sales rose by 0.8%, non-food products (except motor fuel) by 0.5%, and motor fuel in specialised stores by 1.5%. Among the member states with available data, Poland, Cyprus, and Hungary posted the most significant monthly increases in total retail trade volume at 7.3%, 4.8%, and 2.0% respectively. In contrast, Sweden, Malta, and Austria saw the largest declines at 1.8%, 1.0%, and 0.8% respectively. This robust performance within the euro area starkly contrasts with the situation in the United Kingdom, where retail sales in April 2024 plummeted by 4.4% year-on-year, defying expectations for a 1.6% growth. The downturn was attributed to poor weather and the early timing of Easter. Helen Dickinson, chief executive at the British Retail Consortium, noted that dismal weather and disappointing sales contributed to a bleak start to spring, particularly affecting sectors like clothing and footwear, especially outdoor sportswear, as well as garden furniture.","img_path":"\\styles\\images\\economy.jpg"}]